---
kind: type
id: T:Autodesk.Revit.DB.StorageType
source: html/3dbebcb8-792b-a3dd-fe63-faaa05704f3c.htm
---
# Autodesk.Revit.DB.StorageType

An enumerated type listing all of the internal parameter data storage types that Autodesk Revit supports.

## Syntax (C#)
```csharp
public enum StorageType
```